Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Field of &type:
zh_cn: 字段的类型:(&T)

source: Field of type:
zh_cn: 字段的类型:

source: Field to Import
zh_cn: 要导入的字段

source: Field to inline
zh_cn: 要内联的字段

source: Field watchpoint reached
zh_cn: 字段观察点到达

source: Field with name {0} already exists in class ''{1}''.
zh_cn: 名为 {0} 的字段 已存在于类 ''{1}'' 中。

source: Field {0} is already defined in the {1}
zh_cn: 字段 {0} 已经定义在 {1}

source: Field {0} is never used
zh_cn: 字段 {0} 从未使用过

source: Field {0} is not accessible from {1}
zh_cn: 字段 {0} 不可从 {1} 访问

source: Field {0} is not static.
zh_cn: 字段 {0} 不是静态的。

source: Field {0} will hide a field {1} of the base {2}
zh_cn: 字段 {0} 将隐藏 基类 {2} 的一个字段 {1}

source: Field {0} {1}
zh_cn: 字段 {0} {1}

source: Field:
zh_cn: 字段：

source: Fields to Encapsulate
zh_cn: 要封装的字段

source: Fields to be encapsulated
zh_cn: 要封装的字段

source: Fields to be refactored should belong to the same class
zh_cn: 要重构的字段应该属于同一个类

source: Fields {0} are not accessible from {1}
zh_cn: 字段 {0} 不可从 {1} 访问

source: Fields/variables groups
zh_cn: 字段/变量 组

source: Fields:
zh_cn: 字段：

source: File
zh_cn: 文件

source: File ''{0}''
zh_cn: 文件 ''{0}''

source: File &pattern:
zh_cn: 文件模式:(&P)

source: File ''{0}'' already exists.
zh_cn: 文件 ''{0}'' 已经存在。

source: File ''{0}'' is read-only.
zh_cn: 文件 ''{0}'' 是只读的。

source: File ''{0}'' not found
zh_cn: 文件 ''{0}'' 未找到

source: File ''{0}'' not found; breakpoints for this file will be ignored
zh_cn: 文件 ''{0}'' 未找到;该文件的断点将被忽略

source: File ''{0}'' uses spaces for indentation
zh_cn: 文件 ''{0}'' 使用空格缩进

source: File ''{0}'' uses tabs for indentation
zh_cn: 文件 ''{0}'' 使用制表符缩进

source: File - $FILE$
zh_cn: 文件 - $FILE$

source: File Already Exists
zh_cn: 文件已存在

source: File Cache Conflict
zh_cn: 文件缓存冲突

source: File Cache Conflict {0}
zh_cn: 文件缓存冲突 {0}

source: File Creation Failed
zh_cn: 文件创建失败

source: File Encoding
zh_cn: 文件编码

source: File Encodings
zh_cn: 文本编码

source: File Is Read-Only
zh_cn: 文件是只读的

source: File Nesting
zh_cn: 文件嵌套

source: File Nesting...
zh_cn: 文件嵌套...

source: File Not Found
zh_cn: 文件未找到

source: File Open Actions
zh_cn: 文件打开操作

source: File Revisions
zh_cn: 文件修订版本

source: File Status
zh_cn: 文件状态

source: File Status Color
zh_cn: 文件状态颜色

source: File Status Colors
zh_cn: 文件状态颜色

source: File Structure
zh_cn: 文件结构

source: File Template Error
zh_cn: 文件模板错误

source: File Types
zh_cn: 文件类型

source: File _Path
zh_cn: 文件路径(_P)

source: File already exists.
zh_cn: 文件已存在。

source: File and Code Templates
zh_cn: 文件和代码模板

source: File content
zh_cn: 文件内容

source: File content is not available
zh_cn: 文件内容不可用

source: File copying compiler
zh_cn: 文件复制编译

source: File dir relative to the module content root the file belongs to
zh_cn: 相对于文件所属的模块内容根的文件目录

source: File dir relative to the module content root the file belongs to (with forward slashes)
zh_cn: 相对于文件所属的模块内容根的文件目录 (用正斜杠)

source: File dir relative to the sourcepath root the file belongs to
zh_cn: 相对于文件所属的源路径根目录的文件目录

source: File dir relative to the sourcepath root the file belongs to (with forward slashes)
zh_cn: 相对于文件所属的源路径根目录的文件目录 (用正斜杠)

source: File directory
zh_cn: 文件目录

source: File directory name
zh_cn: 文件目录名称

source: File directory relative to the project file
zh_cn: 相对于项目文件的文件目录

source: File directory relative to the project file (with forward slashes)
zh_cn: 相对于项目文件的文件目录 (用正斜杠)

source: File does not exist
zh_cn: 文件不存在

source: File does not pass external validation
zh_cn: 文件未通过外部验证

source: File encoding
zh_cn: 文件编码

source: File extension
zh_cn: 文件扩展名

source: File fully qualified package
zh_cn: 文件完全限定包

source: File has been changed during compilation, inspection validation skipped
zh_cn: 编译期间文件已更改，检查验证跳过

source: File header
zh_cn: 文件头

source: File is changed on server
zh_cn: 文件已在服务器上更改

source: File is read-only
zh_cn: 文件是只读的

source: File is up-to-date
zh_cn: 文件是最新的

source: File m&ask(s)
zh_cn: 文件掩码(&A)

source: File m&ask:
zh_cn: 文件掩码：(&A)

source: File mas&k(s)
zh_cn: 文件掩码(&K)

source: File mas&k:
zh_cn: 文件掩码：(&K)

source: File name
zh_cn: 文件名

source: File name cannot be empty
zh_cn: 文件的名称不能为空

source: File name filter
zh_cn: 文件名称筛选器

source: File name without all extensions
zh_cn: 没有所有扩展名的文件名

source: File name without extension
zh_cn: 不带扩展名的文件名称

source: File name:
zh_cn: 文件名:

source: File not found: {0}
zh_cn: 文件未找到:{0}

source: File package
zh_cn: 文件包

source: File parent directory.
zh_cn: 文件父目录。

source: File path
zh_cn: 文件路径

source: File path relative to the module content root the file belongs to
zh_cn: 相对于文件所属的模块内容根的文件路径

source: File path relative to the module content root the file belongs to (with forward slashes)
zh_cn: 相对于文件所属的模块内容根的文件路径 (用正斜杠)

source: File path relative to the project file
zh_cn: 相对于项目文件的文件路径

source: File path relative to the project file (with forward slashes)
zh_cn: 相对于项目文件的文件路径 (用正斜杠)

source: File path relative to the sourcepath root the file belongs to
zh_cn: 相对于文件所在源路径根目录的文件路径

source: File path relative to the sourcepath root the file belongs to (with forward slashes)
zh_cn: 相对于文件所在源路径根目录的文件路径 (用正斜杠)

source: File path resolving in XML
zh_cn: XML 中的文件路径解析

source: File reference problems
zh_cn: 文件引用问题

source: File structure popup
zh_cn: 文件结构弹窗

source: File system content
zh_cn: 文件系统内容

source: File t&ype:
zh_cn: 文件类型：(&Y)

source: File templates
zh_cn: 文件模板

source: File types
zh_cn: 文件类型

source: File was changed on disk.
zh_cn: 磁盘上的文件已更改。

source: File watcher failed to start
zh_cn: 文件观察器无法启动

source: File watcher gave up to operate
zh_cn: 文件观察器放弃操作

source: File will be copied to this directory
zh_cn: 文件将被复制到此目录

source: File will be moved to this directory
zh_cn: 文件将被移到此目录

source: File {0}
zh_cn: 文件 {0}

source: File {0} History
zh_cn: 文件 {0} 历史

source: File {0} already exists
zh_cn: 文件 {0} 已经存在

source: File {0} already exists Do you want overwrite it or to append?
zh_cn: 文件 {0} 已存在， 要覆盖或追加它吗?

source: File {0} cannot be found
zh_cn: 文件 {0} 未找到

source: File {0} does not exist
zh_cn: 文件 {0} 不存在

source: File {0} does not exist.
zh_cn: 文件 {0} 不存在。

source: File {0} doesn''t exist
zh_cn: 文件 {0} 不存在

source: File {0} has been locally modified.
zh_cn: 文件 {0} 已在本地修改过。

source: File {0} is read-only
zh_cn: 文件 {0} 是只读的

source: File | Settings
zh_cn: 文件 | 设置

source: File/package compilation
zh_cn: 文件/包编译

source: File: {0}
zh_cn: 文件: {0}

source: Files
zh_cn: 文件

source: Files Are Different
zh_cn: 文件是不同的

source: Files Are Identical
zh_cn: 文件是相同的

source: Files Creation/Deletion
zh_cn: 文件创建/删除

source: Files Merged with Conflicts
zh_cn: 文件合并冲突

source: Files Merged with Property Conflicts
zh_cn: 文件合并与属性冲突

source: Files in Previous Search Result
zh_cn: 上一个搜索结果中的文件

source: Files matching pattern
zh_cn: 文件匹配模式

source: Files of this type cannot be opened in {0}
zh_cn: 此类型的文件无法在 {0} 中打开

source: Files to be moved to {0}
zh_cn: 要移动到 {0} 的文件

source: Files {0} are read-only.
zh_cn: 文件 {0} 是只读的。

source: Files: {0} - Classes: {1}
zh_cn: 文件: {0} -类: {1}

source: Filesystem Case-Sensitivity Mismatch
zh_cn: 文件系统大小写敏感性不匹配

source: Fill Paragraph
zh_cn: 填充段落

source: Filter
zh_cn: 过滤

source: Filter TODO Items
zh_cn: 过滤 TODO 项目

source: Filter Update Project information by scope
zh_cn: 按范围过滤更新项目信息

source: Filter by
zh_cn: 过滤通过

source: Filter by Status
zh_cn: 由状态过滤

source: Filter name is not defined
zh_cn: 未定义过滤器名字

source: Filter name should be specified
zh_cn: 应指定过滤器名称

source: Filter resolved items
zh_cn: 过滤已解决的项目

source: Filter should contain at least one pattern
zh_cn: 过滤器应至少包含一个模式

source: Filter targets
zh_cn: 过滤目标

source: Filter with the same name already exists
zh_cn: 具有相同名称的过滤器已经存在

source: Filter...
zh_cn: 过滤...

source: Filtered by:
zh_cn: 过滤通过:

source: Filtering settings affecting selected code fragment...
zh_cn: 影响选定代码片段的过滤设置...

source: Filters
zh_cn: 过滤器

source: Filters enabled by default
zh_cn: 过滤器默认启用

source: Final Modifier
zh_cn: Final 修饰符

source: Final declaration can't be overridden at runtime
zh_cn: Final 声明无法在运行时重写

source: Finalization issues
zh_cn: Finalization 问题

source: Finally, you can enable accepting suggestions by using other punctuation characters (Settings | Editor | General | Completion | Insert selected variant by typing dot, space, etc.)
zh_cn: 最后，您可以通过使用其他标点字符来启用接受建议(Settings | Editor | General | Completion | Insert selected variant by typing dot, space, etc.)

source: Find &All
zh_cn: 查找所有(&A)

source: Find Actions by Shortcut
zh_cn: 用快捷键找到操作

source: Find Duplicates
zh_cn: 发现有重复

source: Find Next
zh_cn: 查找下一个

source: Find Pre_vious / Move to Previous Occurrence
zh_cn: 查找上一个/移到上一个匹配项(_V)

source: Find Previous
zh_cn: 查找上一个

source: Find Shortcut
zh_cn: 查找快捷键

source: Find Text
zh_cn: 查找文本

source: Find Usages
zh_cn: 查找使用

source: Find Usages Of
zh_cn: 找到...的使用

source: Find Usages Settings...
zh_cn: 查找使用设置...

source: Find Usages in File
zh_cn: 在文件中查找使用

source: Find _Join Point Identified by Pointcut
zh_cn: 查找 Pointcut 识别的加入点(_J)

source: Find _Next / Move to Next Occurrence
zh_cn: 查找下一个/移到下一个匹配项(_N)

source: Find _Usages
zh_cn: 查找使用(_U)

source: Find _Word at Caret
zh_cn: 查找插入符号处的字(_W)

source: Find a string in active editor
zh_cn: 在当前编辑窗口中查找字符串

source: Find a string in active editor, shows modal dialog
zh_cn: 在活动编辑器查找一个字符串，并显示模式对话框

source: Find a string in multiple files
zh_cn: 在多个文件中查找字符串

source: Find acceptable class
zh_cn: 找到可接受的类

source: Find and Replace _Code Duplicates...
zh_cn: 查找和替换代码副本...(_C)

source: Find any action, symbol, or setting in &productName; with Double Shift:
zh_cn: 在 &productName; 中双击 Shift 搜索任何操作、符号或设置：

source: Find in Path
zh_cn: 在路径中查找

source: Find in _Path...
zh_cn: 在路径中查找...(_P)

source: Find join point identified by pointcut
zh_cn: 查找 Pointcut 识别的加入点

source: Find next occurrence of the word at caret
zh_cn: 找到插入符号处的字的下一个匹配项

source: Find out about the new features in this version of the IDE
zh_cn: 了解此版本 IDE 中的新功能

source: Find out about the new features in this version of {0}
zh_cn: 了解此版本的 {0} 中的新功能

source: Find usages of the symbol at caret
zh_cn: 查找插入符处符号的使用

source: Find usages of the symbol at caret in active editor
zh_cn: 在活动编辑器中查找插入符号处符号的使用

source: Finding Acceptable URIs
zh_cn: 查找可接受的 URI

source: Finds code in selected scope that can be transformed into a call of selected method/constant
zh_cn: 查找选中范围内的代码，可以转换为选中方法的调用/常量

source: Finish Template
zh_cn: 完成模板

source: Finish lookup by Ctrl+Dot
zh_cn: 通过(Ctrl+点)完成查找

source: Finish lookup by exclamation mark
zh_cn: 通过感叹号完成查找

source: Finish lookup by smart enter
zh_cn: 通过智能输入完成查找

source: Finish lookup by special characters
zh_cn: 通过特殊字符完成查找

source: Finish lookup even when non-focused
zh_cn: 即使不是焦点也完成查找

source: Finished
zh_cn: 完成

source: Finishing VCS refresh
zh_cn: 完成 VCS 刷新

source: Firefox Settings
zh_cn: Firefox 设置

source: First Stroke
zh_cn: 第一次按下键盘

source: First Stroke:
zh_cn: 第一次按下键盘:

source: First letter
zh_cn: 首字母

source: First, right-click the editor tab, and choose Close Others on the context menu.
zh_cn: 其一，右击选项卡，在上下文菜单中选择 Close Others。

source: Fit Content
zh_cn: 适合内容

source: Fit Content After Layout
zh_cn: 布局后适合内容

source: Fix
zh_cn: 修复

source: Fix Arguments
zh_cn: 修复参数

source: Fix Character Literal
zh_cn: 修复字符文字

source: Fix Html
zh_cn: 修复 Html

source: Fix Javadoc
zh_cn: 修复 Javadoc

source: Fix Parameter Type
zh_cn: 修复参数类型

source: Fix StringBuilder append
zh_cn: 修改 StringBuilder append

source: Fix Super Method Return Type
zh_cn: 修复超类方法返回类型

source: Fix Throws List
zh_cn: 修复抛出列表

source: Fix Variable Type
zh_cn: 修复变量类型

source: Fix all ''{0}'' problems in file
zh_cn: 修复文件中的所有 ''{0}'' 问题

source: Fix comparator result comparison
zh_cn: 修复比较器结果比较

source: Fix doc comment
zh_cn: 修复文档注释

source: Fix literal type
zh_cn: 修正文字类型

source: Fix modifiers
zh_cn: 修复修饰符

source: Fix return type
zh_cn: 修复返回类型

source: Fix throws list
zh_cn: 修复 throws 列表

source: Fix…
zh_cn: 修复…

source: Flatten Modules
zh_cn: Flatten 模块

source: Flatten Packages
zh_cn: 拼合包

source: Flatten modules
zh_cn: Flatten 模块

source: Float/unfloat active tool window
zh_cn: 浮动/取消浮动工具窗口

source: Floating _Mode
zh_cn: 浮动模式(_M)

source: Floating point number too large
zh_cn: 浮点数太大

source: Floating point number too small
zh_cn: 浮点数太小

source: Floating ticket obtained
zh_cn: 获得临时授权

source: Focus On Breakpoint
zh_cn: 在断点时获取焦点

source: Focus On Startup
zh_cn: 在启动时获取焦点

source: Focus application on breakpoint
zh_cn: 在断点时聚焦应用

source: Focus this view by default when UI is shown
zh_cn: 当 UI 显示时默认切换到该视图

source: Focus this view by default when breakpoint is reached
zh_cn: 当到达断点时默认切换到该视图

source: Fold Code _Block
zh_cn: 折叠代码块(_B)

source: Fold Selection
zh_cn: 折叠选择

source: Fold _Selection / Remove region
zh_cn: 折叠选中/移除区域(_S)

source: Fold current code block
zh_cn: 折叠当前代码块

source: Fold selected block
zh_cn: 折叠选择块

source: Folded unchanged fragments//Background
zh_cn: 折叠的未更改片断//背景

source: Folded unchanged fragments//Bottom border
zh_cn: 折叠的未更改片断//底部边界

source: Folded unchanged fragments//Top border
zh_cn: 折叠的未更改片断//顶部边界

source: Folder name cannot be empty
zh_cn: 文件夹名称不能为空

source: Folder {0} History
zh_cn: 文件夹 {0} 历史

source: Folding
zh_cn: 折叠

source: FoldingData
zh_cn: 折叠数据

source: Following a link shows documentation for the selected constructor.
zh_cn: 下面的链接显示所选构造函数的文档。

source: Following errors occurred on attempt to save files:
zh_cn: 试图保存文件时发生以下错误:

source: Following files affected by this action have been already changed:
zh_cn: 受此操作影响的以下文件已更改：

source: Following files had big content which was not versioned.
zh_cn: 以下文件的内容过大未被版本控制。

source: Following files have changes that cannot be undone:
zh_cn: 以下文件有无法撤消的更改：

source: Font
zh_cn: 字体

source: Font size:
zh_cn: 字体大小：

source: Font:
zh_cn: 字体:

source: Footer
zh_cn: 页脚

source: For a directory, new line separator applies recursively.
zh_cn: 对于目录，新的换行符递归地应用。

source: For all classes that override 'toString()' method
zh_cn: 为重写了 'toString()' 方法的所有类

source: For classes from the list:
zh_cn: 为来自列表的类:

source: For current project
zh_cn: 为当前项目

source: For default project
zh_cn: 为默认的项目

source: For example, go to the java.util.Collections JDK class, place the cursor within the EMPTY_MAP field and press &shortcut:CopyReference;:
zh_cn: 例如。转到 java.util.Collections JDK 类，将光标放到 EMPTY_MAP 字段内，然后按 &shortcut:CopyReference;：

source: For example, if the *.properties file contains a property value
zh_cn: 比如，如果 *.properties 文件包含属性值

source: For example, in the code fragment below, you can select an expression in the code, and press &shortcut:IntroduceVariable; (Refactor | Extract | Variable).
zh_cn: 例如，在下面的代码片段中，您可以在代码中选择一个表达式，然后按 &shortcut:IntroduceVariable; (Refactor | Extract | Variable)。

source: For example, in the code fragment below, you can select an expression in the code:
zh_cn: 例如，在下面的代码片段中，您可以在代码中选择一个表达式：

source: For example, it may select a method name, then the expression that calls this method, then the whole statement, then the containing block, etc.
zh_cn: 例如，它也许会选择方法名称，然后选择调用此方法的表达式，然后整个语句，然后包含语句的代码块等等。

source: For example, select a code fragment and press &shortcut:MoveStatementUp; or &shortcut:MoveStatementDown;.
zh_cn: 选择一个代码片断，然后按 &shortcut:MoveStatementUp; 或者 &shortcut:MoveStatementDown;。

source: For example, start typing
zh_cn: 例如，开始输入

source: For example, start typing a class name and press &shortcut:CodeCompletion; to complete it.
zh_cn: 例如，先输入一个类名，然后按 &shortcut:CodeCompletion; 来补全它。

source: For example, type
zh_cn: 例如，输入

source: For example, type for in a Django template
zh_cn: 比如，在 Django 模板中输入 for

source: For example, type case and press &shortcut:InsertLiveTemplate; to see what happens.
zh_cn: 例如，键入 case，然后按 &shortcut:InsertLiveTemplate; 查看会发生什么情况。

source: For example, type it and press &shortcut:InsertLiveTemplate; to see what happens.
zh_cn: 比如，输入 it 然后按 &shortcut:InsertLiveTemplate; 看会发生什么。

source: For example, use $DATE$ and $TIME$ to specify the exact date and time of the printout.
zh_cn: 比如，使用 $DATE$ 和 $TIME$ 指明打印的确切日期和时间。

source: For example, when you have
zh_cn: 例如，当你有

source: For example, you can surround html blocks with tags, etc.
zh_cn: 例如，你可以用标签等包围 html 块等。

source: For example, you could select a block of code and press &shortcut:ExtractMethod; (Refactor | Extract -> Method):
zh_cn: 例如，您可以选择一段代码并按 &shortcut:ExtractMethod;(Refactor | Extract -> Method)：

source: For information on how to upgrade your evaluation software please go to {0}
zh_cn: 有关如何升级评估软件的信息，请转到 {0}

source: For statement
zh_cn: For 语句

source: For symbols not supported by the main font
zh_cn: 对于主字体不支持的符号

source: For the embedded local terminal, you can define your favorite shell, default tab name, and other settings.
zh_cn: 对于嵌入的本地终端，您可以定义自己喜欢的 shell，默认选项卡名称和其他设置。

source: For the pattern search in the Go to Class, Go to Symbol and Go to File pop-up frames, use * and space symbols.
zh_cn: 在 Go to Class ， Go to Symbol 和 Go to File 的弹窗的搜索模式中，可以使用 * 和空格符。

source: For {0} of {1} {1,choice, 1#class|2#classes} not all versions were reloaded
zh_cn: {0} / {1} {1,choice, 1#个类|2#个类} 没有所有版本都重新加载

source: For-each loops
zh_cn: For-each 循环

source: For_ward
zh_cn: 向前(_W)

source: Force Class&ic VM for JDK 1.3.x and earlier
zh_cn: 为 JDK 1.3.x 及更早的版本强制使用经典 VM(&I)

source: Force Return
zh_cn: 强制返回

source: Force Run to Cur_sor
zh_cn: 强制运行到光标处(_S)

source: Force Step I_nto
zh_cn: 强制步入(_N)

source: Force Step O_ver
zh_cn: 强制步过(_V)

source: Force a method to return before it reaches a return statement
zh_cn: 强制一个方法在到达返回语句之前返回

source: Force braces
zh_cn: 强制大括号

source: Force non-&empty commit comments
zh_cn: 强制非空提交注释(&E)

source: Force rearrange:
zh_cn: 强制重排：

source: Force rebuild of all caches and indices on next startup
zh_cn: 在下次启动时强制重建所有缓存和索引

source: Force recompilation for selected module, file or package
zh_cn: 强制重新编译所选的模块，文件或包

source: Forcibly terminate debugged application
zh_cn: 强行终止调试应用

source: Foreach parameter initializer can't be inverted
zh_cn: Foreach 的参数初始值不能反转

source: Foreground
zh_cn: 前景

source: Form
zh_cn: 形式

source: Form input without an associated label or title attribute
zh_cn: 表单输入没有相关的标签或标题属性

source: Formatter Control
zh_cn: 格式化控制

source: Formatter off:
zh_cn: 格式化关闭：

source: Formatter on:
zh_cn: 格式化开启：

source: Forward
zh_cn: 向前

source: Found ''{0}'', required ''{1}''
zh_cn: 找到 ''{0}'', 需要 ''{1}''

source: Found 'package.html'
zh_cn: 发现 'package.html'

source: Found Matches in {0}
zh_cn: {0} 中找到匹配

source: Found Occurrences
zh_cn: 找到匹配项

source: Found no modules to depend on
zh_cn: 没有找到要依赖的模块

source: Found no modules which may contain module-info
zh_cn: 找不到可能包含 module-info 的模块

source: Found usages
zh_cn: 找到使用

source: Found yourself in a situation, when you want to use an interpreter located remotely?
zh_cn: 发现有使用远程解释器的情景？

source: Found {0} TODO {0,choice,0#items|1#item|2#items} in {1} {1,choice,0#files|1#file|2#files}
zh_cn: 找到 {0} 条 TODO 项, 位于 {1} 个文件

source: Found {0} dependent files
zh_cn: 找到 {0} 个依赖文件

source: Found {0} matches
zh_cn: 找到 {0} 个匹配项

source: Found: ''{1}'', required: ''{0}''
zh_cn: 找到 ''{1}'', 需要:''{0}''

source: Found: ''{2}'', required: ''{1}''
zh_cn: 找到:''{2}'', 需要:''{1}''

source: Fragment:\&nbsp;{0}
zh_cn: 片断:\&nbsp;{0}

source: Frames
zh_cn: 帧

source: Frames are not available
zh_cn: 帧不可用

source: Frames not available for unsuspended thread
zh_cn: 未暂停线程的桢不可用

source: Framework
zh_cn: 框架

source: Fro&m cursor
zh_cn: 从光标处(&M)

source: From File Template ...
zh_cn: 从文件模板 ...

source: From Template
zh_cn: 从模板

source: From the Changes tool window you can perform all the necessary version control actions: commit changes, manage changelists, put resources under version control, examine differences and more.
zh_cn: 在 Changes 工具窗口，您可以执行所有必要的版本控制操作：提交更改，管理更改列表，将资源放在版本控制下，检查差异等。

source: From the Version Control tool window you can perform all the necessary version control actions: commit changes, manage changelists, put resources under version control, examine differences and more.
zh_cn: 在 Version Control 工具窗口，您可以执行所有必要的版本控制操作：提交更改，管理更改列表，将资源放在版本控制下，检查差异等。

source: From сlipboard
zh_cn: 从剪贴板

source: From:
zh_cn: 从:

source: Full documentation in a pinned window
zh_cn: 在固定窗口显示完整文档

source: Fully &qualified names
zh_cn: 完全限定名(&Q)

source: Fully Expand Tree Node
zh_cn: 完全展开树节点

source: Fully qualified name of a class:
zh_cn: 类的完全限定名：

source: Function
zh_cn: 函数

source: Function may return null, but it's not allowed here
zh_cn: 函数可能返回 null ，但这里不允许

source: Functiona_l Parameter...
zh_cn: Functional 参数...(_L)

source: Functional Variable...
zh_cn: Functional 变量...

source: Functional expression demands functional interface to have exact one method
zh_cn: 函数表达式要求函数接口有一个方法

source: Fuse more statements to the Stream API chain
zh_cn: 将更多的语句融入到 Stream API 链

source: Fuse {0} into the Stream API chain
zh_cn: 将 {0} 融入 Stream API 链

source: GUI Designer forms
zh_cn: GUI 设计形式

source: Ge_nerify...
zh_cn: 泛型...(_N)

source: General
zh_cn: 常规

source: General Options
zh_cn: 常规选项

source: General Settings
zh_cn: 常规设置

source: General Settings for Project ''{0}''
zh_cn: 项目 ''{0}'' 的一般设置

source: Generalize Catch
zh_cn: 泛化 catch

source: Generalize catch for ''{0}'' to ''{1}''
zh_cn: 泛化 catch 从 ''{0}'' 到 ''{1}''

source: Generate
zh_cn: 生成

source: Generate "<p>" on empty lines
zh_cn: 在空行生成 "<p>"

source: Generate &getter for delegated component
zh_cn: 为委托成员生成 getter(&G)

source: Generate &hyperlinks to classes
zh_cn: 生成超链接指向类(&H)

source: Generate 'equals()'
zh_cn: 生成 'equals()'

source: Generate 'hashCode()'
zh_cn: 生成 'hashCode()'

source: Generate Ant Build
zh_cn: 生成 Ant 构建

source: Generate Ant Build File from the Project
zh_cn: 从项目中生成 Ant 构建文件

source: Generate DTD from _XML File
zh_cn: 从 XML 文件生成 DTD(_X)

source: Generate IIOP stubs
zh_cn: 生成 IIOP 存根

source: Generate Instance Document From Schema
zh_cn: 从 Schema 生成实例文档

source: Generate JavaDoc
zh_cn: 生成 JavaDoc

source: Generate Java_Doc...
zh_cn: 生成 JavaDoc...(_D)

source: Generate Module Descriptors
zh_cn: 生成模块描述符

source: Generate Schema From Instance Document
zh_cn: 从实例文档生成 Schema

source: Generate Schema From Instance Xml Document
zh_cn: 从实例 Xml 文档生成 Schema

source: Generate constructor
zh_cn: 生成构造函数

source: Generate constructor, getter or setter method, etc.
zh_cn: 生成的构造函数,getter 或 setter 方法等。

source: Generate createUI(...)
zh_cn: 生成 createUI(...)

source: Generate debugging info
zh_cn: 生成调试信息

source: Generate delegate method to a field/getter
zh_cn: 为字段/getter 生成委托方法

source: Generate equals() and hashCode()
zh_cn: 生成 equals() 和 hashCode()

source: Generate getter
zh_cn: 生成 getter

source: Generate getter and setter
zh_cn: 生成 getter 和 setter

source: Generate hierarchy tree
zh_cn: 生成层次树

source: Generate index
zh_cn: 生成索引

source: Generate module-info Descriptors
zh_cn: 生成 module-info 描述

source: Generate module-info files for all modules in the project (for Java 9 and higher)
zh_cn: 生成项目中所有模块的 module-info 文件(对于 Java 9 和更高版本)

source: Generate multiple-file ant build (requires ant 1.6 or later to execute)
zh_cn: 生成多个文件 Ant 构建 (需要 Ant 1.6或更高版本来执行)

source: Generate navigation bar
zh_cn: 生成导航栏

source: Generate no warnings
zh_cn: 不生成警告

source: Generate or fix doc comment for the current context
zh_cn: 生成或修复当前上下文的文档注释

source: Generate setter
zh_cn: 生成 setter

source: Generate single-file ant build
zh_cn: 生成单文件 Ant 构建

source: Generate super method call
zh_cn: 生成 super 方法调用

source: Generate test &methods for:
zh_cn: 生成测试方法为:(&M)

source: Generate...
zh_cn: 生成...

source: Generate:
zh_cn: 生成:

source: Generated by {0} on {1}
zh_cn: 生成由 {0} 在 {1}

source: Generated equals() for Object[] can be incorrect
zh_cn: 为 Object []生成的 equals() 可能不正确

source: Generated quote marks:
zh_cn: 生成的引号:

source: Generated spectrum to pick colors for local variables and parameters:
zh_cn: 生成光谱以选择局部变量和参数的颜色：

source: Generating HTML...
zh_cn: 生成 HTML...

source: Generating HTML:{0}
zh_cn: 生成 HTML:{0}

source: Generating ant build...
zh_cn: 生成 Ant 构建...

source: Generating file: {0}
zh_cn: 正在生成文件:{0}
